W4D3/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("user_name", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["user_name", "fewfwe"], ["password_digest", "$2a$10$.bgtIetTOlyR3fr0GT6qEOlCHoTyEcmZOjMBTjbnxRDnBhw/S8qB."], ["session_token", "0iYmVYdD6gzC0ebtwjJzMg"]]